const simJsonData = [
    {
        "region": "雙北",
        "current_month": {
            "total": 880,
            "a": 72,
            "b": 164,
            "c": 470,
            "top_problems": {
                "a": "車鈴(無法發出鈴聲)(20)、前／後燈(行進車輪轉動中)(後燈)(17)、煞車功能(煞車過鬆 ( 2/3仍無法煞停 ))(10)",
                "b": "座墊(表面破損、龜裂)(88)、車體外觀(前、後泥除 髒污／破損)(79)、車機功能(借、還車 無提示音、異常)(27)",
                "c": "置物籃(垃圾)(145)、車體外觀(車架 掉漆)(83)、置物籃(破損 2根以上／缺固定螺絲／裝設歪斜)(49)"
            }
        },
        "prev_month": {
            "total": 820,
            "a": 56,
            "b": 166,
            "c": 443
        }
    },
    {
        "region": "桃園",
        "current_month": {
            "total": 287,
            "a": 18,
            "b": 52,
            "c": 132,
            "top_problems": {
                "a": "前／後燈(行進車輪轉動中)(後燈)(3)、車鈴(無法發出鈴聲)(3)、車機功能(借不出還不回／車機異常)(3)",
                "b": "座墊(表面破損、龜裂)(26)、座墊桿(高度調整不順)(7)、車體外觀(前、後泥除 髒污／破損)(5)",
                "c": "置物籃(垃圾)(29)、車體外觀(車架 掉漆)(29)、置物籃(破損 2根以上／缺固定螺絲／裝設歪斜)(16)"
            }
        },
        "prev_month": {
            "total": 248,
            "a": 14,
            "b": 40,
            "c": 107
        }
    },
    {
        "region": "新竹",
        "current_month": {
            "total": 92,
            "a": 10,
            "b": 14,
            "c": 49,
            "top_problems": {
                "a": "煞車功能(煞車過鬆 ( 2/3仍無法煞停 ))(2)、車柱 功能檢查(借還車不順)(2)、前／後燈(行進車輪轉動中)(前燈)(2)",
                "b": "座墊(表面破損、龜裂)(5)、車體外觀(前、後泥除 髒污／破損)(3)、前／後燈(暫停車輪靜止中)(借出後應恆亮【閃爍、時滅時亮勾選】)(2)",
                "c": "車體外觀(車架 掉漆)(22)、置物籃(破損 2根以上／缺固定螺絲／裝設歪斜)(7)、置物籃(垃圾)(7)"
            }
        },
        "prev_month": {
            "total": 88,
            "a": 3,
            "b": 4,
            "c": 40
        }
    },
    {
        "region": "苗栗",
        "current_month": {
            "total": 50,
            "a": 0,
            "b": 2,
            "c": 15,
            "top_problems": {
                "a": "目前無具體問題紀錄",
                "b": "車機功能(借、還車 無提示音、異常)(1)、座墊(髒汙導致無法騎乘)(1)",
                "c": "車柱 周遭環境(車柱)(3)、置物籃(破損 2根以上／缺固定螺絲／裝設歪斜)(2)、置物籃(垃圾)(1)"
            }
        },
        "prev_month": {
            "total": 50,
            "a": 5,
            "b": 2,
            "c": 33
        }
    },
    {
        "region": "台中",
        "current_month": {
            "total": 281,
            "a": 12,
            "b": 29,
            "c": 110,
            "top_problems": {
                "a": "前／後燈(行進車輪轉動中)(後燈)(4)、煞車功能(煞車過鬆 ( 2/3仍無法煞停 ))(3)、車機功能(借不出還不回／車機異常)(2)",
                "b": "座墊(表面破損、龜裂)(9)、車機功能(借、還車 無提示音、異常)(7)、車機功能(螢幕文字 無法正常顯示)(5)",
                "c": "車體外觀(車架 掉漆)(43)、置物籃(破損 2根以上／缺固定螺絲／裝設歪斜)(17)、置物籃(垃圾)(8)"
            }
        },
        "prev_month": {
            "total": 259,
            "a": 9,
            "b": 20,
            "c": 129
        }
    },
    {
        "region": "嘉義",
        "current_month": {
            "total": 80,
            "a": 4,
            "b": 20,
            "c": 18,
            "top_problems": {
                "a": "前／後燈(行進車輪轉動中)(前燈)(1)、前／後燈(行進車輪轉動中)(後燈)(1)、煞車功能(煞車過鬆 ( 2/3仍無法煞停 ))(1)",
                "b": "座墊(表面破損、龜裂)(8)、車機功能(螢幕文字 無法正常顯示)(5)、車機功能(借、還車 無提示音、異常)(4)",
                "c": "置物籃(垃圾)(6)、置物籃(破損 2根以上／缺固定螺絲／裝設歪斜)(2)、車柱 外觀檢查(柱號貼紙)(2)"
            }
        },
        "prev_month": {
            "total": 80,
            "a": 6,
            "b": 22,
            "c": 45
        }
    },
    {
        "region": "台南",
        "current_month": {
            "total": 152,
            "a": 9,
            "b": 21,
            "c": 76,
            "top_problems": {
                "a": "前／後燈(行進車輪轉動中)(後燈)(4)、車鈴(無法發出鈴聲)(2)、前／後燈(行進車輪轉動中)(前燈)(1)",
                "b": "座墊(表面破損、龜裂)(6)、外管完整(蛇管 脫落／遺失)(5)、輪胎(胎紋磨損 平滑、龜裂、反光帶脫落)(4)",
                "c": "置物籃貼紙(後 使用說明)(18)、置物籃(破損 2根以上／缺固定螺絲／裝設歪斜)(14)、車體外觀(車架 掉漆)(10)"
            }
        },
        "prev_month": {
            "total": 142,
            "a": 2,
            "b": 31,
            "c": 74
        }
    },
    {
        "region": "高雄",
        "current_month": {
            "total": 288,
            "a": 10,
            "b": 69,
            "c": 195,
            "top_problems": {
                "a": "前／後燈(行進車輪轉動中)(前燈)(4)、前／後燈(行進車輪轉動中)(後燈)(3)、車機功能(借不出還不回／車機異常)(1)",
                "b": "座墊(表面破損、龜裂)(24)、車機功能(借、還車 無提示音、異常)(20)、輪胎(胎紋磨損 平滑、龜裂、反光帶脫落)(5)",
                "c": "車體外觀(車架 掉漆)(115)、置物籃(破損 2根以上／缺固定螺絲／裝設歪斜)(53)、置物籃貼紙(後 使用說明)(27)"
            }
        },
        "prev_month": {
            "total": 288,
            "a": 11,
            "b": 69,
            "c": 196
        }
    },
    {
        "region": "屏東",
        "current_month": {
            "total": 40,
            "a": 5,
            "b": 7,
            "c": 12,
            "top_problems": {
                "a": "前／後燈(行進車輪轉動中)(前燈)(3)、前／後燈(行進車輪轉動中)(後燈)(3)、煞車功能(煞車過鬆 ( 2/3仍無法煞停 ))(1)",
                "b": "座墊(表面破損、龜裂)(1)、外管完整(變速外管)(1)",
                "c": "置物籃貼紙(後 使用說明)(3)、置物籃(破損 2根以上／缺固定螺絲／裝設歪斜)(2)、車體外觀(車架 掉漆)(1)"
            }
        },
        "prev_month": {
            "total": 40,
            "a": 2,
            "b": 6,
            "c": 25
        }
    },
    {
        "region": "台東",
        "current_month": {
            "total": 24,
            "a": 1,
            "b": 3,
            "c": 10,
            "top_problems": {
                "a": "前／後燈(行進車輪轉動中)(後燈)(1)",
                "b": "煞車功能(異音)(2)、外管完整(蛇管 脫落／遺失)(1)",
                "c": "置物籃(破損 2根以上／缺固定螺絲／裝設歪斜)(3)、置物籃貼紙(後 使用說明)(1)"
            }
        },
        "prev_month": {
            "total": 24,
            "a": 0,
            "b": 3,
            "c": 12
        }
    }
];