const simJsonData = [
    {
        "region": "雙北",
        "current_month": {
            "total": 820,
            "a": 56,
            "b": 166,
            "c": 433,
            "top_problems": {
                "a": "前／後燈(行進車輪轉動中)(後燈)(14)、前／後燈(行進車輪轉動中)(前燈)(9)、車鈴(無法發出鈴聲)(8)",
                "b": "座墊(表面破損、龜裂)(85)、車體外觀(前、後泥除 髒污／破損)(65)、車機功能(借、還車 無提示音、異常)(33)",
                "c": "置物籃(垃圾)(112)、車體外觀(車架 掉漆)(84)、置物籃(破損 2根以上／缺固定螺絲／裝設歪斜)(56)"
            }
        },
        "prev_month": {
            "total": 869,
            "a": 50,
            "b": 169,
            "c": 518
        }
    },
    {
        "region": "桃園",
        "current_month": {
            "total": 248,
            "a": 14,
            "b": 40,
            "c": 107,
            "top_problems": {
                "a": "前／後燈(行進車輪轉動中)(後燈)(7)、前／後燈(行進車輪轉動中)(前燈)(5)、車柱 功能檢查(借還車不順)(2)",
                "b": "座墊(表面破損、龜裂)(22)、車體外觀(前、後泥除 髒污／破損)(8)、前／後燈(暫停車輪靜止中)(借出刷卡、臨停解鎖即亮【未即亮勾選】)(4)",
                "c": "車體外觀(車架 掉漆)(30)、置物籃(垃圾)(26)、置物籃(破損 2根以上／缺固定螺絲／裝設歪斜)(13)"
            }
        },
        "prev_month": {
            "total": 245,
            "a": 9,
            "b": 40,
            "c": 152
        }
    },
    {
        "region": "新竹",
        "current_month": {
            "total": 88,
            "a": 3,
            "b": 4,
            "c": 40,
            "top_problems": {
                "a": "車柱 功能檢查(借還車不順)(1)、車機功能(借不出還不回／車機異常)(1)、前／後燈(行進車輪轉動中)(後燈)(1)",
                "b": "車體外觀(前、後泥除 髒污／破損)(4)、座墊桿(高度調整不順)(1)、煞車功能(異音)(1)",
                "c": "置物籃(破損 2根以上／缺固定螺絲／裝設歪斜)(6)、置物籃貼紙(後 使用說明)(5)、置物籃(垃圾)(5)"
            }
        },
        "prev_month": {
            "total": 84,
            "a": 3,
            "b": 8,
            "c": 55
        }
    },
    {
        "region": "苗栗",
        "current_month": {
            "total": 50,
            "a": 5,
            "b": 2,
            "c": 33,
            "top_problems": {
                "a": "前／後燈(行進車輪轉動中)(後燈)(3)、車機功能(借不出還不回／車機異常)(2)、前／後燈(行進車輪轉動中)(前燈)(2)",
                "b": "輪胎(胎紋磨損 平滑、龜裂、反光帶脫落)(1)",
                "c": "車體外觀(車架 掉漆)(20)、置物籃貼紙(後 使用說明)(5)、車柱 外觀檢查(柱號貼紙)(2)"
            }
        },
        "prev_month": {
            "total": 50,
            "a": 2,
            "b": 0,
            "c": 29
        }
    },
    {
        "region": "台中",
        "current_month": {
            "total": 259,
            "a": 9,
            "b": 20,
            "c": 122,
            "top_problems": {
                "a": "前／後燈(行進車輪轉動中)(後燈)(4)、前／後燈(行進車輪轉動中)(前燈)(3)、車柱 功能檢查(借還車不順)(1)",
                "b": "車機功能(借、還車 無提示音、異常)(7)、座墊(表面破損、龜裂)(6)、車體外觀(前、後泥除 髒污／破損)(4)",
                "c": "車體外觀(車架 掉漆)(47)、置物籃(破損 2根以上／缺固定螺絲／裝設歪斜)(11)、置物籃(垃圾)(7)"
            }
        },
        "prev_month": {
            "total": 284,
            "a": 11,
            "b": 31,
            "c": 148
        }
    },
    {
        "region": "嘉義",
        "current_month": {
            "total": 80,
            "a": 6,
            "b": 22,
            "c": 45,
            "top_problems": {
                "a": "煞車功能(煞車過鬆 ( 2/3仍無法煞停 ))(2)、前／後燈(行進車輪轉動中)(後燈)(1)、車鈴(無法發出鈴聲)(1)",
                "b": "座墊(表面破損、龜裂)(12)、輪胎(胎紋磨損 平滑、龜裂、反光帶脫落)(3)、隨車鎖(上鎖／解鎖 失敗、異常)(1)",
                "c": "車體外觀(車架 掉漆)(20)、置物籃貼紙(前 車號、LOGO)(6)、置物籃(破損 2根以上／缺固定螺絲／裝設歪斜)(4)"
            }
        },
        "prev_month": {
            "total": 100,
            "a": 2,
            "b": 25,
            "c": 61
        }
    },
    {
        "region": "台南",
        "current_month": {
            "total": 142,
            "a": 2,
            "b": 31,
            "c": 74,
            "top_problems": {
                "a": "前／後燈(行進車輪轉動中)(後燈)(1)、車鈴(無法發出鈴聲)(1)",
                "b": "外管完整(變速外管)(10)、座墊(表面破損、龜裂)(7)、輪胎(胎紋磨損 平滑、龜裂、反光帶脫落)(2)",
                "c": "置物籃貼紙(後 使用說明)(16)、置物籃(破損 2根以上／缺固定螺絲／裝設歪斜)(13)、一級檢修貼紙(無法辨識／資訊不完整)(10)"
            }
        },
        "prev_month": {
            "total": 128,
            "a": 5,
            "b": 17,
            "c": 84
        }
    },
    {
        "region": "高雄",
        "current_month": {
            "total": 288,
            "a": 11,
            "b": 69,
            "c": 194,
            "top_problems": {
                "a": "前／後燈(行進車輪轉動中)(前燈)(6)、前／後燈(行進車輪轉動中)(後燈)(5)、車鈴(無法發出鈴聲)(2)",
                "b": "座墊(表面破損、龜裂)(23)、車機功能(借、還車 無提示音、異常)(16)、輪胎(胎紋磨損 平滑、龜裂、反光帶脫落)(13)",
                "c": "車體外觀(車架 掉漆)(105)、置物籃(破損 2根以上／缺固定螺絲／裝設歪斜)(49)、置物籃貼紙(後 使用說明)(28)"
            }
        },
        "prev_month": {
            "total": 291,
            "a": 18,
            "b": 84,
            "c": 206
        }
    },
    {
        "region": "屏東",
        "current_month": {
            "total": 40,
            "a": 2,
            "b": 6,
            "c": 25,
            "top_problems": {
                "a": "前／後燈(行進車輪轉動中)(後燈)(2)、前／後燈(行進車輪轉動中)(前燈)(1)",
                "b": "座墊(表面破損、龜裂)(2)、車機機殼(髒污／塗鴉／小廣告／褪色)(2)、煞車功能(異音)(1)",
                "c": "車體外觀(車架 掉漆)(5)、置物籃貼紙(後 使用說明)(4)、置物籃(破損 2根以上／缺固定螺絲／裝設歪斜)(3)"
            }
        },
        "prev_month": {
            "total": 39,
            "a": 4,
            "b": 7,
            "c": 25
        }
    },
    {
        "region": "台東",
        "current_month": {
            "total": 24,
            "a": 0,
            "b": 3,
            "c": 12,
            "top_problems": {
                "a": "目前無具體問題紀錄",
                "b": "輪胎(胎紋磨損 平滑、龜裂、反光帶脫落)(2)、隨車鎖(上鎖／解鎖 失敗、異常)(1)、車體外觀(前、後泥除 髒污／破損)(1)",
                "c": "置物籃(垃圾)(4)、置物籃(嚴重髒汙、沾黏)(2)、置物籃(破損 2根以上／缺固定螺絲／裝設歪斜)(2)"
            }
        },
        "prev_month": {
            "total": 24,
            "a": 0,
            "b": 2,
            "c": 12
        }
    }
];

